app/Helpers/login_helper.php

SELECT *
FROM `users`
WHERE `id_user` = '9'
---
function userlogin()
{
    $db = \Config\Database::connect();
    return $db->table('users')->where('id_user', session('id_user'))->get()->getRow();

SELECT *
FROM `users`
WHERE `id_user` = '9'
---
function hakAkses()
{
    $db = \Config\Database::connect();
    return $db->table('users')->where('id_user', session('id_user'))->get()->getRow();