app/Controllers/Mahasiswa.php

    public function index()
    {

        $this->db = \Config\Database::connect();
        if ($this->db->table('tagihan')->where('tagihan', 1)) {
            $data['tagihan'] = $this->db->table('tagihan')
                ->where('nama_mahasiswa', session()->get('id_user'))
                ->join('users', 'users.id_user = tagihan.nama_mahasiswa')
                ->get();
---
SELECT *
FROM `tagihan`
JOIN `users` ON `users`.`id_user` = `tagihan`.`nama_mahasiswa`
WHERE `nama_mahasiswa` = '9'

    public function bayar()
    {
        $this->db = \Config\Database::connect();
        $data['tagihan'] = $this->db->table('tagihan')
            ->where('nama_mahasiswa', session()->get('id_user'))
            ->join('users', 'users.id_user = tagihan.nama_mahasiswa')
            ->get();
---
SELECT *
FROM `tagihan`
JOIN `users` ON `users`.`id_user` = `tagihan`.`nama_mahasiswa`
WHERE `nama_mahasiswa` = '9'